app/controllers/activities_controller.rb

INSERT INTO "activities" ("created_user_id", "assigned_user_id", "title", "description", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @activity = Activity.new(activity_params)

    respond_to do |format|
      if @activity.save

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_activity
      @activity = Activity.find(params[:id])