app/controllers/notifications_controller.rb

SELECT "notifications".* FROM "notifications"
---
  def index
    @notifications = Notification.all

SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 149], ["LIMIT", 1]]
---
    def set_notification
      @notification = Notification.find(params[:id])