app/controllers/static_pages_controller.rb

  def index
    @activities = Activity.all.where(assigned_user_id: current_user[:id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."assigned_user_id" = $1  [["assigned_user_id", 1]]