app/controllers/subactivities_controller.rb

SELECT "subactivities".* FROM "subactivities"
---
  def index
    @subactivities = Subactivity.all

INSERT INTO "subactivities" ("activity_id", "title", "description", "image", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["activity_id", 1], ["title", "teste"], ["description", "teste"], ["image", "teste"], ["done", "f"], ["created_at", "2017-08-27 04:41:12.349366"], ["updated_at", "2017-08-27 04:41:12.349366"]]
---
  def create
    @subactivity = Subactivity.new(subactivity_params)

    respond_to do |format|
      if @subactivity.save

DELETE FROM "subactivities" WHERE "subactivities"."id" = $1  [["id", 4]]
---
  def destroy
    @subactivity.destroy

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "subactivities".* FROM "subactivities" WHERE "subactivities"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_subactivity
      @subactivity = Subactivity.find(params[:id])