app/views/activities/_form.html.erb

    <%= f.label :assigned_user_id, 'Usuário que realizará a atividade' %>
    <%= f.collection_select(:assigned_user_id, User.all, :id, :name, {}, { class: 'form-control' } ) %>
---
SELECT "users".* FROM "users"