app/views/layouts/_navbar.html.erb


            <li> <%= link_to 'Pedir Ajuda', Notification.create(created_user_id:current_user.id, assigned_user_id: User.find(current_user.id).superuser, read:false) %> </li>
---
INSERT INTO "notifications" ("created_user_id", "assigned_user_id", "read", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_user_id", 2], ["assigned_user_id", 1], ["read", "f"], ["created_at", "2017-08-27 12:59:19.906765"], ["updated_at", "2017-08-27 12:59:19.906765"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]